---
kind: type
id: T:Autodesk.Revit.DB.Structure.AreaLoadType
source: html/eb4b548c-059a-d0d7-2431-8203c29dfebd.htm
---
# Autodesk.Revit.DB.Structure.AreaLoadType

AreaLoadType class

## Syntax (C#)
```csharp
public class AreaLoadType : LoadTypeBase
```